// constants/calendar.constants.js

export const MONTH_NAMES = [
  'Январь',
  'Февраль',
  'Март',
  'Апрель',
  'Май',
  'Июнь',
  'Июль',
  'Август',
  'Сентябрь',
  'Октябрь',
  'Ноябрь',
  'Декабрь',
]

export const MONTH_NAMES_GENITIVE = [
  'Января',
  'Февраля',
  'Марта',
  'Апреля',
  'Мая',
  'Июня',
  'Июля',
  'Августа',
  'Сентября',
  'Октября',
  'Ноября',
  'Декабря',
]

export const DAY_NAMES = [
  'Понедельник',
  'Вторник',
  'Среда',
  'Четверг',
  'Пятница',
  'Суббота',
  'Воскресенье',
]
export const DAY_NAMES_SHORT = ['ПН', 'ВТ', 'СР', 'ЧТ', 'ПТ', 'СБ', 'ВС']
/**
 * Словарь типов дней
 */
export const TYPE_LABELS = {
  default: '—',
  work: 'Рабочий день',
  'time-off': 'Отгул',
  decree: 'Декрет',
  medical: 'Больничный',
  vacation: 'Отпуск',
  weekend: 'Выходной',
  holiday: 'Праздник',
  preholiday: 'Предпраздничный день',
}
